dogusyuksel/ti_cc2640r2f_sdk/ccs1281/ccs/ccs_base/common/targetdb/Modules/msp/mspm0gx51x/GPIOB_1.0.xml
    <register id="GPIOB_DOUT23_20" width="32" offset="0x1214" description="Data output 23 to 20">
        <bitfield id="DIO20" description="This bit sets the value of the pin configured as DIO20 when the output is enabled through DOE31_0 register." begin="0" end="0" width="1" rwaccess="R/W">
            <bitenum id="ZERO" value="0x0" description="Output is set to 0"/>
            <bitenum id="ONE" value="0x1" description="Output is set to 1"/>
        </bitfield>
        <bitfield id="DIO21" description="This bit sets the value of the pin configured as DIO21 when the output is enabled through DOE31_0 register." begin="8" end="8" width="1" rwaccess="R/W">
            <bitenum id="ZERO" value="0x0" description="Output is set to 0"/>
            <bitenum id="ONE" value="0x1" description="Output is set to 1"/>
        </bitfield>
        <bitfield id="DIO22" description="This bit sets the value of the pin configured as DIO22 when the output is enabled through DOE31_0 register." begin="16" end="16" width="1" rwaccess="R/W">
            <bitenum id="ZERO" value="0x0" description="Output is set to 0"/>
            <bitenum id="ONE" value="0x1" description="Output is set to 1"/>
        </bitfield>
        <bitfield id="DIO23" description="This bit sets the value of the pin configured as DIO23 when the output is enabled through DOE31_0 register." begin="24" end="24" width="1" rwaccess="R/W">
            <bitenum id="ZERO" value="0x0" description="Output is set to 0"/>
            <bitenum id="ONE" value="0x1" description="Output is set to 1"/>
        </bitfield>
    </register>
    <register id="GPIOB_DOUT27_24" width="32" offset="0x1218" description="Data output 27 to 24">
        <bitfield id="DIO24" description="This bit sets the value of the pin configured as DIO24 when the output is enabled through DOE31_0 register." begin="0" end="0" width="1" rwaccess="R/W">
            <bitenum id="ZERO" value="0x0" description="Output is set to 0"/>
            <bitenum id="ONE" value="0x1" description="Output is set to 1"/>
        </bitfield>
        <bitfield id="DIO25" description="This bit sets the value of the pin configured as DIO25 when the output is enabled through DOE31_0 register." begin="8" end="8" width="1" rwaccess="R/W">
            <bitenum id="ZERO" value="0x0" description="Output is set to 0"/>
            <bitenum id="ONE" value="0x1" description="Output is set to 1"/>
        </bitfield>
        <bitfield id="DIO26" description="This bit sets the value of the pin configured as DIO26 when the output is enabled through DOE31_0 register." begin="16" end="16" width="1" rwaccess="R/W">
            <bitenum id="ZERO" value="0x0" description="Output is set to 0"/>
            <bitenum id="ONE" value="0x1" description="Output is set to 1"/>
        </bitfield>
        <bitfield id="DIO27" description="This bit sets the value of the pin configured as DIO27 when the output is enabled through DOE31_0 register." begin="24" end="24" width="1" rwaccess="R/W">
            <bitenum id="ZERO" value="0x0" description="Output is set to 0"/>
            <bitenum id="ONE" value="0x1" description="Output is set to 1"/>
        </bitfield>
    </register>
    <register id="GPIOB_DOUT31_28" width="32" offset="0x121C" description="Data output 31 to 28">
        <bitfield id="DIO28" description="This bit sets the value of the pin configured as DIO28 when the output is enabled through DOE31_0 register." begin="0" end="0" width="1" rwaccess="R/W">
            <bitenum id="ZERO" value="0x0" description="Output is set to 0"/>
            <bitenum id="ONE" value="0x1" description="Output is set to 1"/>
        </bitfield>
        <bitfield id="DIO29" description="This bit sets the value of the pin configured as DIO29 when the output is enabled through DOE31_0 register." begin="8" end="8" width="1" rwaccess="R/W">
            <bitenum id="ZERO" value="0x0" description="Output is set to 0"/>
            <bitenum id="ONE" value="0x1" description="Output is set to 1"/>
        </bitfield>
        <bitfield id="DIO30" description="This bit sets the value of the pin configured as DIO30 when the output is enabled through DOE31_0 register." begin="16" end="16" width="1" rwaccess="R/W">
            <bitenum id="ZERO" value="0x0" description="Output is set to 0"/>
            <bitenum id="ONE" value="0x1" description="Output is set to 1"/>
        </bitfield>
        <bitfield id="DIO31" description="This bit sets the value of the pin configured as DIO31 when the output is enabled through DOE31_0 register." begin="24" end="24" width="1" rwaccess="R/W">
            <bitenum id="ZERO" value="0x0" description="Output is set to 0"/>
            <bitenum id="ONE" value="0x1" description="Output is set to 1"/>
        </bitfield>
    </register>
    <register id="GPIOB_DOUT31_0" width="32" offset="0x1280" description="Data output 31 to 0">
        <bitfield id="DIO0" description="This bit sets the value of the pin configured as DIO0 when the output is enabled through DOE31_0 register." begin="0" end="0" width="1" rwaccess="R/W">
            <bitenum id="ZERO" value="0x0" description="Output is set to 0"/>
            <bitenum id="ONE" value="0x1" description="Output is set to 1"/>
        </bitfield>
        <bitfield id="DIO1" description="This bit sets the value of the pin configured as DIO1 when the output is enabled through DOE31_0 register." begin="1" end="1" width="1" rwaccess="R/W">
            <bitenum id="ZERO" value="0x0" description="Output is set to 0"/>
            <bitenum id="ONE" value="0x1" description="Output is set to 1"/>
        </bitfield>
        <bitfield id="DIO2" description="This bit sets the value of the pin configured as DIO2 when the output is enabled through DOE31_0 register." begin="2" end="2" width="1" rwaccess="R/W">
            <bitenum id="ZERO" value="0x0" description="Output is set to 0"/>
            <bitenum id="ONE" value="0x1" description="Output is set to 1"/>
        </bitfield>
        <bitfield id="DIO3" description="This bit sets the value of the pin configured as DIO3 when the output is enabled through DOE31_0 register." begin="3" end="3" width="1" rwaccess="R/W">
            <bitenum id="ZERO" value="0x0" description="Output is set to 0"/>
            <bitenum id="ONE" value="0x1" description="Output is set to 1"/>
        </bitfield>
        <bitfield id="DIO4" description="This bit sets the value of the pin configured as DIO4 when the output is enabled through DOE31_0 register." begin="4" end="4" width="1" rwaccess="R/W">
            <bitenum id="ZERO" value="0x0" description="Output is set to 0"/>
            <bitenum id="ONE" value="0x1" description="Output is set to 1"/>
        </bitfield>
        <bitfield id="DIO5" description="This bit sets the value of the pin configured as DIO5 when the output is enabled through DOE31_0 register." begin="5" end="5" width="1" rwaccess="R/W">
            <bitenum id="ZERO" value="0x0" description="Output is set to 0"/>
            <bitenum id="ONE" value="0x1" description="Output is set to 1"/>
        </bitfield>
        <bitfield id="DIO6" description="This bit sets the value of the pin configured as DIO6 when the output is enabled through DOE31_0 register." begin="6" end="6" width="1" rwaccess="R/W">
            <bitenum id="ZERO" value="0x0" description="Output is set to 0"/>
            <bitenum id="ONE" value="0x1" description="Output is set to 1"/>
        </bitfield>
        <bitfield id="DIO7" description="This bit sets the value of the pin configured as DIO7 when the output is enabled through DOE31_0 register." begin="7" end="7" width="1" rwaccess="R/W">
            <bitenum id="ZERO" value="0x0" description="Output is set to 0"/>
            <bitenum id="ONE" value="0x1" description="Output is set to 1"/>
        </bitfield>
        <bitfield id="DIO8" description="This bit sets the value of the pin configured as DIO8 when the output is enabled through DOE31_0 register." begin="8" end="8" width="1" rwaccess="R/W">
            <bitenum id="ZERO" value="0x0" description="Output is set to 0"/>
            <bitenum id="ONE" value="0x1" description="Output is set to 1"/>
        </bitfield>
        <bitfield id="DIO9" description="This bit sets the value of the pin configured as DIO9 when the output is enabled through DOE31_0 register." begin="9" end="9" width="1" rwaccess="R/W">
            <bitenum id="ZERO" value="0x0" description="Output is set to 0"/>
            <bitenum id="ONE" value="0x1" description="Output is set to 1"/>
        </bitfield>
        <bitfield id="DIO10" description="This bit sets the value of the pin configured as DIO10 when the output is enabled through DOE31_0 register." begin="10" end="10" width="1" rwaccess="R/W">
            <bitenum id="ZERO" value="0x0" description="Output is set to 0"/>
            <bitenum id="ONE" value="0x1" description="Output is set to 1"/>
        </bitfield>
        <bitfield id="DIO11" description="This bit sets the value of the pin configured as DIO11 when the output is enabled through DOE31_0 register." begin="11" end="11" width="1" rwaccess="R/W">
            <bitenum id="ZERO" value="0x0" description="Output is set to 0"/>
            <bitenum id="ONE" value="0x1" description="Output is set to 1"/>
        </bitfield>
        <bitfield id="DIO12" description="This bit sets the value of the pin configured as DIO12 when the output is enabled through DOE31_0 register." begin="12" end="12" width="1" rwaccess="R/W">
            <bitenum id="ZERO" value="0x0" description="Output is set to 0"/>
            <bitenum id="ONE" value="0x1" description="Output is set to 1"/>
        </bitfield>
        <bitfield id="DIO13" description="This bit sets the value of the pin configured as DIO13 when the output is enabled through DOE31_0 register." begin="13" end="13" width="1" rwaccess="R/W">
            <bitenum id="ZERO" value="0x0" description="Output is set to 0"/>
            <bitenum id="ONE" value="0x1" description="Output is set to 1"/>
        </bitfield>
        <bitfield id="DIO14" description="This bit sets the value of the pin configured as DIO14 when the output is enabled through DOE31_0 register." begin="14" end="14" width="1" rwaccess="R/W">
            <bitenum id="ZERO" value="0x0" description="Output is set to 0"/>
            <bitenum id="ONE" value="0x1" description="Output is set to 1"/>
        </bitfield>
        <bitfield id="DIO15" description="This bit sets the value of the pin configured as DIO15 when the output is enabled through DOE31_0 register." begin="15" end="15" width="1" rwaccess="R/W">
            <bitenum id="ZERO" value="0x0" description="Output is set to 0"/>
            <bitenum id="ONE" value="0x1" description="Output is set to 1"/>
        </bitfield>
        <bitfield id="DIO16" description="This bit sets the value of the pin configured as DIO16 when the output is enabled through DOE31_0 register." begin="16" end="16" width="1" rwaccess="R/W">
            <bitenum id="ZERO" value="0x0" description="Output is set to 0"/>
            <bitenum id="ONE" value="0x1" description="Output is set to 1"/>
        </bitfield>
        <bitfield id="DIO17" description="This bit sets the value of the pin configured as DIO17 when the output is enabled through DOE31_0 register." begin="17" end="17" width="1" rwaccess="R/W">
            <bitenum id="ZERO" value="0x0" description="Output is set to 0"/>
            <bitenum id="ONE" value="0x1" description="Output is set to 1"/>
        </bitfield>
        <bitfield id="DIO18" description="This bit sets the value of the pin configured as DIO18 when the output is enabled through DOE31_0 register." begin="18" end="18" width="1" rwaccess="R/W">
            <bitenum id="ZERO" value="0x0" description="Output is set to 0"/>
            <bitenum id="ONE" value="0x1" description="Output is set to 1"/>
        </bitfield>
        <bitfield id="DIO19" description="This bit sets the value of the pin configured as DIO19 when the output is enabled through DOE31_0 register." begin="19" end="19" width="1" rwaccess="R/W">
            <bitenum id="ZERO" value="0x0" description="Output is set to 0"/>
            <bitenum id="ONE" value="0x1" description="Output is set to 1"/>
        </bitfield>
        <bitfield id="DIO20" description="This bit sets the value of the pin configured as DIO20 when the output is enabled through DOE31_0 register." begin="20" end="20" width="1" rwaccess="R/W">
            <bitenum id="ZERO" value="0x0" description="Output is set to 0"/>
            <bitenum id="ONE" value="0x1" description="Output is set to 1"/>
        </bitfield>
        <bitfield id="DIO21" description="This bit sets the value of the pin configured as DIO21 when the output is enabled through DOE31_0 register." begin="21" end="21" width="1" rwaccess="R/W">
            <bitenum id="ZERO" value="0x0" description="Output is set to 0"/>
            <bitenum id="ONE" value="0x1" description="Output is set to 1"/>
        </bitfield>
        <bitfield id="DIO22" description="This bit sets the value of the pin configured as DIO22 when the output is enabled through DOE31_0 register." begin="22" end="22" width="1" rwaccess="R/W">
            <bitenum id="ZERO" value="0x0" description="Output is set to 0"/>
            <bitenum id="ONE" value="0x1" description="Output is set to 1"/>
        </bitfield>
        <bitfield id="DIO23" description="This bit sets the value of the pin configured as DIO23 when the output is enabled through DOE31_0 register." begin="23" end="23" width="1" rwaccess="R/W">
            <bitenum id="ZERO" value="0x0" description="Output is set to 0"/>
            <bitenum id="ONE" value="0x1" description="Output is set to 1"/>
        </bitfield>
        <bitfield id="DIO24" description="This bit sets the value of the pin configured as DIO24 when the output is enabled through DOE31_0 register." begin="24" end="24" width="1" rwaccess="R/W">
            <bitenum id="ZERO" value="0x0" description="Output is set to 0"/>
            <bitenum id="ONE" value="0x1" description="Output is set to 1"/>
        </bitfield>
        <bitfield id="DIO25" description="This bit sets the value of the pin configured as DIO25 when the output is enabled through DOE31_0 register." begin="25" end="25" width="1" rwaccess="R/W">
            <bitenum id="ZERO" value="0x0" description="Output is set to 0"/>
            <bitenum id="ONE" value="0x1" description="Output is set to 1"/>
        </bitfield>
        <bitfield id="DIO26" description="This bit sets the value of the pin configured as DIO26 when the output is enabled through DOE31_0 register." begin="26" end="26" width="1" rwaccess="R/W">
            <bitenum id="ZERO" value="0x0" description="Output is set to 0"/>
            <bitenum id="ONE" value="0x1" description="Output is set to 1"/>
        </bitfield>
        <bitfield id="DIO27" description="This bit sets the value of the pin configured as DIO27 when the output is enabled through DOE31_0 register." begin="27" end="27" width="1" rwaccess="R/W">
            <bitenum id="ZERO" value="0x0" description="Output is set to 0"/>
            <bitenum id="ONE" value="0x1" description="Output is set to 1"/>
        </bitfield>
        <bitfield id="DIO28" description="This bit sets the value of the pin configured as DIO28 when the output is enabled through DOE31_0 register." begin="28" end="28" width="1" rwaccess="R/W">
            <bitenum id="ZERO" value="0x0" description="Output is set to 0"/>
            <bitenum id="ONE" value="0x1" description="Output is set to 1"/>
        </bitfield>
        <bitfield id="DIO29" description="This bit sets the value of the pin configured as DIO29 when the output is enabled through DOE31_0 register." begin="29" end="29" width="1" rwaccess="R/W">
            <bitenum id="ZERO" value="0x0" description="Output is set to 0"/>
            <bitenum id="ONE" value="0x1" description="Output is set to 1"/>
        </bitfield>
        <bitfield id="DIO30" description="This bit sets the value of the pin configured as DIO30 when the output is enabled through DOE31_0 register." begin="30" end="30" width="1" rwaccess="R/W">
            <bitenum id="ZERO" value="0x0" description="Output is set to 0"/>
            <bitenum id="ONE" value="0x1" description="Output is set to 1"/>
        </bitfield>
        <bitfield id="DIO31" description="This bit sets the value of the pin configured as DIO31 when the output is enabled through DOE31_0 register." begin="31" end="31" width="1" rwaccess="R/W">
            <bitenum id="ZERO" value="0x0" description="Output is set to 0"/>
            <bitenum id="ONE" value="0x1" description="Output is set to 1"/>
        </bitfield>
    </register>
